app/views/gossips/index.html.erb

        <p class="card-text"><%= t.content %></p>
        <p class="card-text text-muted">Posted by <%= @user.find(t.user_id).first_name%></p>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]