app/views/gossips/show.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 12], ["LIMIT", 1]]
SELECT  "cities".* FROM "cities" WHERE "cities"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]
---
        <h6 class="card-subtitle mb-2 text-muted">modifié le: <%=@gossip.updated_at.strftime("%d/%m/%Y")%></h6>
        <h6 class="card-subtitle mb-2 text-muted"><%= link_to @user.find(@gossip.user_id).first_name ,author_path(@gossip.user_id)%></h6>
        <p class="card-text"><%= @gossip.content %></p>
        <p class="card-text"> ville : <%=link_to "#{@city.find(@user.find(@gossip.user_id).city_id).name}", city_path(@user.find(@gossip.user_id).city_id) %></p>

SELECT "comments".* FROM "comments" WHERE "comments"."gossip_id" = $1  [["gossip_id", 1]]
---
       <p>Commentaires du potin :</p>
         <% @gossip.comments.each do |comment| %>

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 13], ["LIMIT", 1]]
---
               <div class="card-body">
                 <h6 class="card-subtitle mb-2 text-muted">Auteur : <%= link_to comment.user.first_name, author_path(comment.user.id) %></h6>