app/controllers/author_controller.rb

  def show
    @user = User.find(params[:id])
    @city = City.all
    @gossips = Gossip.all
    @gossip = User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 12], ["LIMIT", 1]]

  def create
      nb = rand(1..10)
      @user_create = User.new(first_name: params[:first_name], last_name: params[:last_name], age: params[:age], city_id: nb, email: params[:email], password: params[:password], password_confirmation: params[:password_confirmation], description: params[:description])
      if @user_create.save
---
INSERT INTO "users" ("first_name", "last_name", "description", "email", "age", "city_id", "password_digest") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

  def update
    @user = User.find(params[:id])
  #j'applique la modif à moins que compare_user est faux (voir applicationController)
    unless compare_user(session[params[:user_id]], params[:user_id]) == false
      if @user.update(first_name: params[:first_name], last_name: params[:last_name], age: params[:age], description: params[:description], password: :password_confirmation)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 12], ["LIMIT", 1]]
UPDATE "users" SET "age" = $1, "description" = $2, "password_digest" = $3 WHERE "users"."id" = $4  [["age", 28], ["description", "qjkbqdsf ujbdg"], ["password_digest", "$2a$12$4jTlHKbPysI0fpIrBTh4ouEacoekb/8mcdlPrI7StS9bw8IbZvMx6"], ["id", 12]]