app/controllers/cities_controller.rb

  def show
    @gossips = Gossip.all
    @city = City.find(params[:id])
---
SELECT  "cities".* FROM "cities" WHERE "cities"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]