app/controllers/comments_controller.rb

SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "comments" ("content", "created_at", "updated_at", "user_id", "gossip_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["content", "truc de fou"], ["created_at", "2019-11-01 15:13:24.279036"], ["updated_at", "2019-11-01 15:13:24.279036"], ["user_id", 13], ["gossip_id", 1]]
---
  def create
    @comment = Comment.new(content: params[:content], user: current_user, gossip: Gossip.find(params[:gossip_id]))
    puts params.inspect
    if @comment.save

SELECT  "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 13], ["LIMIT", 1]]
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "comments" SET "content" = $1, "updated_at" = $2 WHERE "comments"."id" = $3  [["content", "truc de fo"], ["updated_at", "2019-11-01 15:52:04.125364"], ["id", 1]]
---
  def update
    @comment = Comment.find(params[:id])
  #j'applique la modif à moins que compare_user est faux (voir applicationController)
    unless compare_user(session[:user_id], @comment.user_id) == false
      if @comment.update(content: params[:content], user: current_user, gossip: Gossip.find(params[:gossip_id]))

SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def destroy
    @gossip = Gossip.find(params[:id])