app/controllers/gossips_controller.rb

  def index
    @gossip = Gossip.all
    @user = User.all
---
SELECT "gossips".* FROM "gossips"
SELECT "users".* FROM "users"

  def show
    @gossip = Gossip.find(params[:id])
    @user = User.all
    @city = City.all
    @comment = Comment.all
---
SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."gossip_id" = $1  [["gossip_id", 1]]

  def create
    @gossip = Gossip.new(user_id: session[:user_id], title: params[:title], content: params[:content]) # avec xxx qui sont les données obtenues à partir du formulaire

    if @gossip.save # essaie de sauvegarder en base @gossip
---
INSERT INTO "gossips" ("title", "content", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "titre"], ["content", "contenue contenant du contenue demon gossip"], ["user_id", 13], ["created_at", "2019-11-01 17:24:45.822472"], ["updated_at", "2019-11-01 17:24:45.822472"]]

  def update
    @gossip = Gossip.find(params[:id])
  #j'applique la modif à moins que compare_user est faux (voir applicationController)
    unless compare_user(session[:user_id], @gossip.user_id) == false
      if @gossip.update(title: params[:title], content: params[:content])
---
SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 33], ["LIMIT", 1]]
UPDATE "gossips" SET "title" = $1, "content" = $2, "updated_at" = $3 WHERE "gossips"."id" = $4  [["title", "modification"], ["content", "test alert de la modification"], ["updated_at", "2019-11-01 11:00:21.010683"], ["id", 11]]

  def destroy
    @gossip = Gossip.find(params[:id])
    unless compare_user(session[:user_id], @gossip.user_id) == false
      if @gossip.destroy
---
SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "gossips" WHERE "gossips"."id" = $1  [["id", 11]]