app/views/author/show.html.erb

SELECT  "cities".* FROM "cities" WHERE "cities"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
    <p class="card-text">email : <%= @user.email %></p>
    <a class="" href="<%= city_path(@user.city_id) %>">City : <%= @city.find(@user.city_id).name %> </a>